In [1]:
import pandas as pd
import pyodbc
import sqlite3

# iedereen heeft andere servername btw

In [2]:
servername = 'DESKTOP-LVEKE4S\\SQLEXPRESS01'

# Northwind connectie

In [3]:
northwind_conn = pyodbc.connect('DRIVER={SQL SERVER};SERVER='+servername+';DATABASE=NorthWind; Trusted_Connection=yes')
nwCursor = northwind_conn.cursor()
nwCursor

# Adventureworks connectie

In [4]:
adventureworks_conn = pyodbc.connect('DRIVER={SQL SERVER};SERVER='+servername+';DATABASE=AdventureWorks2019; Trusted_Connection=yes')
awCursor = adventureworks_conn.cursor()
awCursor

# Aenc connectie

In [5]:
aenc_conn = pyodbc.connect('DRIVER={Microsoft Access Driver (*.mdb, *.accdb)};DBQ=../raw-databases/aenc.accdb;')
aencCursor = aenc_conn.cursor()

# DWH connectie

In [6]:
export_conn = pyodbc.connect('DRIVER={SQL SERVER};SERVER='+servername+';DATABASE=UnitedOutdoors; Trusted_Connection=yes')
export_cursor = export_conn.cursor()

# Northwind orders

In [7]:
nw_order = pd.read_sql_query('SELECT * FROM Orders', northwind_conn)
nw_orderdetails = pd.read_sql_query('SELECT * FROM [Order Details]', northwind_conn)
nw_order_combo = pd.merge(nw_order, nw_orderdetails, on='OrderID', how='left')
nw_order_combo_trim = nw_order_combo[['OrderID', 'Quantity', 'UnitPrice', 'ProductID', 'EmployeeID', 'CustomerID', 'OrderDate', 'ShippedDate']]
nw_order_combo_trim = nw_order_combo_trim.rename(columns={'OrderID': 'order_id', 'Quantity': 'product_quantity', 'UnitPrice': 'product_listprice', 'ProductID': 'product_productid','EmployeeID': 'employee_employeeid', 'CustomerID': 'customer_id', 'OrderDate': 'order_date', 'ShippedDate': 'shipping_date'})
nw_order_combo_trim
# aenc_order = pd.read_sql_query('SELECT * FROM sales_order', aenc_conn)
# aw_order = pd.read_sql_query('SELECT * FROM Sales.SalesOrderHeader', adventureworks_conn)

C:\Users\jordi\AppData\Local\Temp\ipykernel_11436\1381926839.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  nw_order = pd.read_sql_query('SELECT * FROM Orders', northwind_conn)
C:\Users\jordi\AppData\Local\Temp\ipykernel_11436\1381926839.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  nw_orderdetails = pd.read_sql_query('SELECT * FROM [Order Details]', northwind_conn)

,order_id,product_quantity,product_listprice,product_productid,employee_employeeid,customer_id,order_date,shipping_date
0,10248,12,14.00,11,5,VINET,1996-07-04,1996-07-16
1,10248,10,9.80,42,5,VINET,1996-07-04,1996-07-16
2,10248,5,34.80,72,5,VINET,1996-07-04,1996-07-16
3,10249,9,18.60,14,6,TOMSP,1996-07-05,1996-07-10
4,10249,40,42.40,51,6,TOMSP,1996-07-05,1996-07-10
...,...,...,...,...,...,...,...,...
2150,11077,2,33.25,64,1,RATTC,1998-05-06,NaT
2151,11077,1,17.00,66,1,RATTC,1998-05-06,NaT
2152,11077,2,15.00,73,1,RATTC,1998-05-06,NaT
2153,11077,4,7.75,75,1,RATTC,1998-05-06,NaT
2154,11077,2,13.00,77,1,RATTC,1998-05-06,NaT

# aenc orders

In [8]:
aenc_order = pd.read_sql_query('SELECT * FROM sales_order', aenc_conn)
aenc_orderdetails = pd.read_sql_query('SELECT * FROM sales_order_item', aenc_conn)
aenc_products = pd.read_sql_query('SELECT id, unit_price FROM product', aenc_conn)
aenc_order_combo = pd.merge(aenc_order, aenc_orderdetails, on='id', how='left')
aenc_order_combo = pd.merge(aenc_order_combo, aenc_products, left_on='prod_id', right_on='id', how='inner')
aenc_order_combo_trim = aenc_order_combo[['id_x', 'quantity', 'unit_price', 'prod_id', 'sales_rep', 'cust_id', 'order_date', 'ship_date']]
aenc_order_combo_trim = aenc_order_combo_trim.rename(columns={'id_x': 'order_id', 'quantity': 'product_quantity', 'unit_price': 'product_listprice', 'prod_id': 'product_productid', 'sales_rep': 'employee_employeeid', 'cust_id': 'customer_id', 'ship_date': 'shipping_date'})
aenc_order_combo_trim['order_date'] = pd.to_datetime(aenc_order_combo_trim['order_date'], format='%d-%b-%Y %I:%M:%S %p')
aenc_order_combo_trim['shipping_date'] = pd.to_datetime(aenc_order_combo_trim['shipping_date'], format='%d-%b-%Y %I:%M:%S %p')
aenc_order_combo_trim
# nw_order_combo

C:\Users\jordi\AppData\Local\Temp\ipykernel_11436\1010520910.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenc_order = pd.read_sql_query('SELECT * FROM sales_order', aenc_conn)
C:\Users\jordi\AppData\Local\Temp\ipykernel_11436\1010520910.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenc_orderdetails = pd.read_sql_query('SELECT * FROM sales_order_item', aenc_conn)
C:\Users\jordi\AppData\Local\Temp\ipykernel_11436\1010520910.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenc_products = pd.read_sql_query('SELECT id, unit_price FROM product', aenc_conn)

,order_id,product_quantity,product_listprice,product_productid,employee_employeeid,customer_id,order_date,shipping_date
0,2001,12,9,300,299,101,1996-03-14,1996-09-15
1,2001,12,14,301,299,101,1996-03-14,1996-09-14
2,2001,12,14,302,299,101,1996-03-14,1996-09-14
3,2002,24,9,400,467,102,1996-03-18,1996-09-18
4,2002,24,10,401,467,102,1996-03-18,1996-09-18
...,...,...,...,...,...,...,...,...
1098,2652,10,9,300,902,174,1998-11-26,1998-12-01
1099,2653,0,14,301,148,102,1999-01-17,1999-10-17
1100,2654,15,14,301,148,105,1999-02-26,1999-10-29
1101,2654,3,14,302,148,105,1999-02-26,1999-10-29
1102,2654,8,9,400,148,105,1999-02-26,1999-10-29

# adventureworks orders

In [9]:
aw_order = pd.read_sql_query('SELECT * FROM Sales.SalesOrderHeader', adventureworks_conn)
aw_orderdetails = pd.read_sql_query('SELECT * FROM Sales.SalesOrderDetail', adventureworks_conn)
aw_order_combo = pd.merge(aw_order, aw_orderdetails, on='SalesOrderID', how='left')
aw_order_combo_trim = aw_order_combo[['SalesOrderID', 'OrderQty', 'UnitPrice', 'ProductID', 'SalesPersonID', 'CustomerID', 'OrderDate', 'ShipDate']]
aw_order_combo_trim = aw_order_combo_trim.rename(columns={'SalesOrderID': 'order_id', 'OrderQty': 'product_quantity', 'UnitPrice': 'product_listprice', 'ProductID': 'product_productid', 'SalesPersonID': 'employee_employeeid', 'CustomerID': 'customer_id', 'OrderDate': 'order_date', 'ShipDate': 'shipping_date'})
aw_order_combo_trim

C:\Users\jordi\AppData\Local\Temp\ipykernel_11436\4186337951.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aw_order = pd.read_sql_query('SELECT * FROM Sales.SalesOrderHeader', adventureworks_conn)
C:\Users\jordi\AppData\Local\Temp\ipykernel_11436\4186337951.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aw_orderdetails = pd.read_sql_query('SELECT * FROM Sales.SalesOrderDetail', adventureworks_conn)

,order_id,product_quantity,product_listprice,product_productid,employee_employeeid,customer_id,order_date,shipping_date
0,43659,1,2024.994,776,279.0,29825,2011-05-31,2011-06-07
1,43659,3,2024.994,777,279.0,29825,2011-05-31,2011-06-07
2,43659,1,2024.994,778,279.0,29825,2011-05-31,2011-06-07
3,43659,1,2039.994,771,279.0,29825,2011-05-31,2011-06-07
4,43659,1,2039.994,772,279.0,29825,2011-05-31,2011-06-07
...,...,...,...,...,...,...,...,...
121312,75122,1,21.980,878,NaN,15868,2014-06-30,2014-07-07
121313,75122,1,8.990,712,NaN,15868,2014-06-30,2014-07-07
121314,75123,1,21.980,878,NaN,18759,2014-06-30,2014-07-07
121315,75123,1,159.000,879,NaN,18759,2014-06-30,2014-07-07
121316,75123,1,8.990,712,NaN,18759,2014-06-30,2014-07-07

# Combineer alle orders

In [33]:
aenc_en_nw_orders = pd.concat([aenc_order_combo_trim, nw_order_combo_trim])
alle_orders = pd.concat([aenc_en_nw_orders, aw_order_combo_trim])
alle_orders = alle_orders.where(pd.notna(alle_orders), None)
alle_orders.shipping_date = alle_orders.shipping_date.astype(object).where(alle_orders.shipping_date.notnull(), None)
alle_orders

,order_id,product_quantity,product_listprice,product_productid,employee_employeeid,customer_id,order_date,shipping_date
0,2001,12,9,300,299,101,1996-03-14,1996-09-15 00:00:00
1,2001,12,14,301,299,101,1996-03-14,1996-09-14 00:00:00
2,2001,12,14,302,299,101,1996-03-14,1996-09-14 00:00:00
3,2002,24,9,400,467,102,1996-03-18,1996-09-18 00:00:00
4,2002,24,10,401,467,102,1996-03-18,1996-09-18 00:00:00
...,...,...,...,...,...,...,...,...
121312,75122,1,21.98,878,None,15868,2014-06-30,2014-07-07 00:00:00
121313,75122,1,8.99,712,None,15868,2014-06-30,2014-07-07 00:00:00
121314,75123,1,21.98,878,None,18759,2014-06-30,2014-07-07 00:00:00
121315,75123,1,159.0,879,None,18759,2014-06-30,2014-07-07 00:00:00
121316,75123,1,8.99,712,None,18759,2014-06-30,2014-07-07 00:00:00

# Eerst date tabel invullen

In [42]:
from datetime import datetime
for index, row in alle_orders.iterrows():
    if row.shipping_date != None: 
        date_string = [row['order_date'], row['shipping_date']]
    else:
        date_string = [row['order_date']]
    for dateString in date_string:
        dateString = dateString.strftime('%Y-%m-%d')
        date_parts = dateString.split("-")
        # date_obj = datetime.strptime(dateString, '%d-%m-%Y')
        # date_value = date_obj.strftime('%Y-%m-%d')
        # Extract year, month, and day
        year = int(date_parts[0])
        month = int(date_parts[1])
        day = int(date_parts[2])
        try:
            query = """INSERT INTO date_table (
                DATE_date,
                DATE_year_nr, 
                DATE_month_nr, 
                DATE_day_nr
            ) VALUES (?, ?, ?, ?)"""

            values = (
                dateString, 
                year,
                month,
                day
            )

            export_conn.execute(query, values)

        except pyodbc.IntegrityError as e:
            continue
        except pyodbc.Error as e:
            print("Er is een fout opgetreden: ", e)
            print("Foutieve query: ", query)


export_conn.commit()

# Export

In [43]:
for index, row in alle_orders.iterrows():
    try:
        query = """INSERT INTO order_details (
            order_id,
            product_quantity, 
            product_listprice,
            order_date,
            shipping_date,
            product_productid,
            employee_employeeid,
            customer_id
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?)"""  
        
        values = (
            row['order_id'],
            row['product_quantity'],
            row['product_listprice'],
            row['order_date'],
            row['shipping_date'],
            row['product_productid'],
            row['employee_employeeid'],
            row['customer_id'],
        )

        export_cursor.execute(query, values)

    except pyodbc.IntegrityError as e:
        continue
    except pyodbc.Error as e:
        print("row: ", row)
        print("Er is een fout opgetreden: ", e)
        print("Foutieve query: ", query)
    
export_conn.commit()